[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=8
width=640
height=640
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00261
burn_in=1000
max_batches = 500500
policy=steps
steps=400000,450000
scales=.1,.1

#cutmix=1
mosaic=1

# 0
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=mish

# Downsample

# 1
[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=mish

#[convolutional]
#batch_normalize=1
#filters=64
#size=1
#stride=1
#pad=1
#activation=mish

#[route]
#layers = -2

#[convolutional]
#batch_normalize=1
#filters=64
#size=1
#stride=1
#pad=1
#activation=mish

# 2
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

# 3
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

# 4
[shortcut]
from=-3
activation=linear

#[convolutional]
#batch_normalize=1
#filters=64
#size=1
#stride=1
#pad=1
#activation=mish

#[route]
#layers = -1,-7

#[convolutional]
#batch_normalize=1
#filters=64
#size=1
#stride=1
#pad=1
#activation=mish

# Downsample

# 5
[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=mish

# 6
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# 7
[route]
layers = -2

# 8
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# 9
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# 10
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

# 11
[shortcut]
from=-3
activation=linear

# 12
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# 13
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

# 14
[shortcut]
from=-3
activation=linear

# 15
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# 16
[route]
layers = -1,-10

# 17
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# Downsample

# 18
[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=mish

# 19
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 20
[route]
layers = -2

# 21
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 22
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 23
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 24
[shortcut]
from=-3
activation=linear

# 25
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 26
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 27
[shortcut]
from=-3
activation=linear

# 28
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 29
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 30
[shortcut]
from=-3
activation=linear

# 31
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 32
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 33
[shortcut]
from=-3
activation=linear


# 34
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 35
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 36
[shortcut]
from=-3
activation=linear

# 37
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 38
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 39
[shortcut]
from=-3
activation=linear

# 40
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 41
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 42
[shortcut]
from=-3
activation=linear

# 43
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 44
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

# 45
[shortcut]
from=-3
activation=linear

# 46
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 47
[route]
layers = -1,-28

# 48
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# Downsample

# 49
[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=mish

# 50
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 51
[route]
layers = -2

# 52
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 53
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 54
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 55
[shortcut]
from=-3
activation=linear


# 56
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 57
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 58
[shortcut]
from=-3
activation=linear


# 59
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 60
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 61
[shortcut]
from=-3
activation=linear


# 62
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 63
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 64
[shortcut]
from=-3
activation=linear


# 65
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 66
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 67
[shortcut]
from=-3
activation=linear


# 68
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 69
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 70
[shortcut]
from=-3
activation=linear


# 71
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 72
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 73
[shortcut]
from=-3
activation=linear

# 74
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 75
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

# 76
[shortcut]
from=-3
activation=linear

# 77
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 78
[route]
layers = -1,-28

# 79
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# Downsample

# 80
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=2
pad=1
activation=mish

# 81
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 82
[route]
layers = -2

# 83
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 84
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 85
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

# 86
[shortcut]
from=-3
activation=linear

# 87
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 88
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

# 89
[shortcut]
from=-3
activation=linear

# 90
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 91
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

# 92
[shortcut]
from=-3
activation=linear

# 93
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 94
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

# 95
[shortcut]
from=-3
activation=linear

# 96
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 97
[route]
layers = -1,-16

# 98
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=mish

##########################

# 99
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 100
[route]
layers = -2

# 101
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 102
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

# 103
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

### SPP ###
# 104
[maxpool]
stride=1
size=5

# 105
[route]
layers=-2

# 106
[maxpool]
stride=1
size=9

# 107
[route]
layers=-4

# 108
[maxpool]
stride=1
size=13

# 109
[route]
layers=-1,-3,-5,-6
### End SPP ###

# 110
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 111
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

# 112
[route]
layers = -1, -13

# 113
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 114
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 115
[upsample]
stride=2

# 116
[route]
layers = 79

# 117
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 118
[route]
layers = -1, -3

# 119
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 120
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 121
[route]
layers = -2

# 122
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 123
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

# 124
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 125
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

# 126
[route]
layers = -1, -6

# 127
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 128
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 129
[upsample]
stride=2

# 130
[route]
layers = 48

# 131
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 132
[route]
layers = -1, -3

# 133
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 134
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 135
[route]
layers = -2

# 136
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 137
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=mish

# 138
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# 139
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=mish

# 140
[route]
layers = -1, -6

# 141
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##########################

# 142
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

# 143
[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear


# 144
[yolo]
mask = 0,1,2
anchors = 11,11, 9,21, 11,26, 14,31, 31,32, 23,52, 27,64, 46,186, 50,220
classes=8
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
scale_x_y = 1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

# 145
[route]
layers = -4

# 146
[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=mish

# 147
[route]
layers = -1, -20

# 148
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 149
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 150
[route]
layers = -2

# 151
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 152
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

# 153
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 154
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

# 155
[route]
layers = -1,-6

# 156
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# 157
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

# 158
[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear


# 159
[yolo]
mask = 3,4,5
anchors = 11,11, 9,21, 11,26, 14,31, 31,32, 23,52, 27,64, 46,186, 50,220
classes=8
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
scale_x_y = 1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

# 160
[route]
layers = -4

# 161
[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=mish

# 162
[route]
layers = -1, -49

# 163
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 164
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 165
[route]
layers = -2

# 166
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 167
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

# 168
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 169
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

# 170
[route]
layers = -1,-6

# 171
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# 172
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=mish

# 173
[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear


# 174
[yolo]
mask = 6,7,8
anchors = 11,11, 9,21, 11,26, 14,31, 31,32, 23,52, 27,64, 46,186, 50,220
classes=8
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
scale_x_y = 1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
